# BOT_NAME = "Деканат на минималках 👩🏼‍🏫"
# BOT_DESCRIPTION = "Я — ваш помощник в студенческой группе! Помогу с развлечениями, организацией и учебой. Деканат отдыхает, пока я работаю 🤓"
# BOT_SHORT_DESCRIPTION = "Добавь меня в чат группы, дай доступ к сообщениям и кайфуй от учебы 🔥"

START_FROM_CHAT = 'Привет! Я — ваш помощник для организации и управления студенческой группой. Добавь меня в чат (это можно сделать из моего профиля), и я помогу с напоминаниями, важными задачами и сделаю общение ещё удобнее! 🚀\n\nКак добавишь меня в группу, обязательно нажми /start !'
START_FROM_GROUP = 'Спасибо, что добавили меня в группу! Теперь я готов помочь с организацией, напоминаниями и всем, что связано с вашей студенческой жизнью. Если нужно что-то, просто напишите! 📚✨\nВ первую очередь, ОБЯЗАТЕЛЬНО СДЕЛАЙ МЕНЯ АДМИНОМ, чтобы все мои команды работали 🤗'

TAROT_SUCCESS = 'Вот ваша карта таро! ✨ Погрузитесь в мир предсказаний и загадок.'
TAROT_FAIL = 'К сожалению не получилось получить карточку 😞'
TAROT_PENDING = 'Уже колдую тебе предсказание ✨'

JOKE_PENDING = 'Уже вспоминаю анекдот 🧐'
JOKE_SUCCESS = 'Вот шутка специально для тебя 😉'
JOKE_SUCCESS_BAD = 'Вот шутка специально для тебя 😉 Напоминаю, что там может быть и черный юмор 🔞'
JOKE_FAIL = 'Прости, но сегодня я забыл все анекдоты 😔'

FORTUNE_RESPONSES = [
    "Вам предстоит важное решение. Прислушайтесь к своему сердцу.",
    "Скоро в вашей жизни появится новый шанс. Не упустите его!",
    "Судьба готовит вам приятный сюрприз. Ожидайте позитивных изменений!",
    "Не бойтесь перемен. Они приведут к чему-то большому и важному.",
    "Верьте в себя — ваши усилия скоро принесут плоды.",
    "День будет благоприятным для начала нового проекта. Время действовать!",
    "Интуиция подскажет вам правильный путь. Прислушивайтесь к себе.",
    "Не бойтесь рисковать. Судьба улыбается смелым!",
    "В ближайшее время вам предстоит встретить кого-то, кто окажет большое влияние на вашу жизнь.",
    "Судьба дарит вам шанс изменить что-то важное в своей жизни. Используйте его!",

    "Будьте осторожны — не всё так, как кажется на первый взгляд.",
    "Сейчас не лучшее время для принятия решений. Ожидайте препятствий.",
    "Вам предстоит столкнуться с трудностями. Будьте готовы к борьбе.",
    "Не все ваши усилия будут вознаграждены. Это не конец, но нужно быть осторожным.",
    "Жизнь может преподнести вам неприятный сюрприз, будьте готовы к неожиданностям.",
    "Вам предстоит столкнуться с разочарованием, но это временно.",
    "Будьте осторожны с людьми вокруг — не все ваши друзья на самом деле друзья.",
    "Не теряйте надежду, но будьте готовы к трудным временам.",

    "Судьба пока молчит, но скоро откроется перед вами новый путь.",
    "Ответ ещё не ясен, всё зависит от ваших действий.",
    "Будущее не решено, всё в ваших руках.",
    "Вы стоите на перекрёстке. Куда приведёт этот путь — зависит от вас.",
    "Всё ещё не ясно. Судьба оставляет вам выбор.",
    "Будьте готовы ко всему — будущее скрыто в тумане.",
    "Сейчас не время для уверенности, но всё может измениться в любой момент.",
    "Ваши действия могут изменить ход событий. Пока трудно сказать, что произойдёт."
]

STUDENT_STATUSES = [
    "Герой пятой пары — жив, но устал.",
    "Гуру прокрастинации. Завтра начну, честно!",
    "Король отписок и царство дедлайнов.",
    "Мастер кофе и ночных марафонов по учебникам.",
    "Профессиональный пересдающий — легенда университета.",
    "Архитектор шпаргалок: построю знания на бумажках!",
    "Человек-зачем-я-это-выбрал. Классика жанра.",
    "Супергерой! Но костюм остался дома, а в душе паника.",
    "Вечный первокурсник — всегда удивлён, как тут всё работает.",
    "Художник зачетки: рисую оценки наугад.",
    "Кибер-оптимист: сдаю через Wi-Fi… когда-нибудь.",
    "Магистр выкручиваний: «я так и задумал(а)!»",
    "Шеф-повар столовой — специалист по макаронам с чем-то.",
    "Студент-сфера: идеален в теории, катится по жизни.",
    "Тень преподавателя: всегда в курсе, но в сторонке.",
    "Министр учёбы, но в отставке.",
    "Философ пары: 'Если я не отвечаю, значит, я думаю!'",
    "Турист: захожу в универ раз в месяц с экскурсией.",
    "Режиссёр курсовой: продакшн задерживается, премьера скоро!",
    "Человек-помню-только-обед. Главное — не проголодаться!"
]
CHILL_GUY_STICKERS = [
    "CAACAgQAAxkBAAKL-WdHhxfTiizxLb8AAcEG-Tj9N6y20AACtRUAAl8c6VHd-XV7JZcPETYE",
    "CAACAgQAAxkBAAKL_GdHhxnrrX7J0XQDVOHPBp8r-sYzAAKeFQACqGXoUc5NoLhhjBLkNgQ",
    "CAACAgQAAxkBAAKL_2dHhxoVY9PWujITtLYP17yYTS1wAAI4FgACoGXxUUivOxX4aCZcNgQ",
    "CAACAgQAAxkBAAKMAmdHhxsGNVMZvOxIhtP5vJ-nVRbAAAMcAAK_fehRJVe6OMp9Hoo2BA",
    "CAACAgQAAxkBAAKMBWdHhxv5tDnJZzncsapK0ULOfVaHAAI8EwACogHxUdGb-mst8UAONgQ",
    "CAACAgQAAxkBAAKMCGdHhxwrnVBKiLbwXZuN0qkBDWbqAALxFwACjOnpUUTsQ3aHDkAQNgQ",
    "CAACAgQAAxkBAAKMCGdHhxwrnVBKiLbwXZuN0qkBDWbqAALxFwACjOnpUUTsQ3aHDkAQNgQ",
    "CAACAgQAAxkBAAKMDmdHhx0G8W0kh39qpb9Bw8tdPaG_AAIjFgACuaXpUUk2_SvK1N3pNgQ",
    "CAACAgQAAxkBAAKMEWdHhx4ggRM6YUtE4NGgtiC2ucfIAAKwFwACvXzpUeM5rPygVyJANgQ",
    "CAACAgQAAxkBAAKMFGdHhx950M_BesTVItKy6Kj24JjBAAIgFgAC84L5UTyJIP46nNnDNgQ",
    "CAACAgQAAxkBAAKMF2dHhx-vhL6NP-IWp-Ohtkmi_4MnAAIXFgACJ3rwUZGdCyGWbc03NgQ",
    "CAACAgQAAxkBAAKMGmdHhyDsF2tDULIR8WCkQnhVefqlAAKDHAACDEPxUcnSovGcpZKTNgQ",
    "CAACAgQAAxkBAAKMHWdHhyF0uHawemRwDGaOE_BkopYiAAJDGQAC62T4UUJdHzLhxX5kNgQ",
    "CAACAgQAAxkBAAKMIGdHhyJL1t0T__tnZFrsg8ZF1tX2AALjFwACQkb5UXAGxTqoX-xzNgQ",
    "CAACAgQAAxkBAAKMI2dHhyIhcdCVcCVydt-R06NTJeFjAALdFQACFk7wUSCSkFZ_QVnFNgQ",
    "CAACAgQAAxkBAAKMJmdHhyN64NH_G5tadY6c3NmqkYJjAAJxGQAC5cX5Uat1mzG2F-klNgQ",
    "CAACAgQAAxkBAAKMKWdHhyMfN77-OSbUzo7BWzym3GNvAAKqFwACfs34UTju5fd1DGfTNgQ",
    "CAACAgQAAxkBAAKMLGdHhyQojR0JYuP6TwdZIxVe-HVPAAJWGgACWzz4UaxiXmveNLMbNgQ",
    "CAACAgQAAxkBAAKML2dHhyWrK0pCl21hQlPacFriLGwkAALGEwAC5HP4Ue8tu06wbmJtNgQ",
    "CAACAgQAAxkBAAKMMWdHhyV0XS3Z63ZQOY-rxUIaPA3pAALGFQACgWL5UVRl2OGRFUX6NgQ",
    "CAACAgQAAxkBAAKMNWdHhyb2mbBwWYsZWiRAjYBk_COdAAKKFQACFJT4UShnozF8ApVCNgQ",
    "CAACAgQAAxkBAAKMOGdHhyYe1TBvT2JHUG7sGnsblUkgAAKAFAACQ6b5UdHPOnLrhB6FNgQ"
]

NOT_ADMIM = "Похоже, у меня нет прав админа, поэтому я не могу выполнить эту команду 😔"

PROCCESS_DEADLINE = lambda text: f"Отлично!\nКогда тебе напомнить о \"<i>{text}</i>\"\n❓введи дату в формате DD.MM.YYYY, например 25.05.2006"
DEADLINE_PARSE_ERROR = "Это не похоже на дату 🙁\n❓еще раз введи дату в формате DD.MM.YYYY, например 25.05.2006"
DEADLINE_INVALID_DATE = "Это дата давно в прошлом, выбери дату в будущем ➡️\n❓еще раз введи дату в формате DD.MM.YYYY, например 25.05.2006"
DEADLINE_ADD_SUCCESS = "Отлично!\nЯ напомню тебе за <b>неделю</b>, <b>3 дня</b> и <b>1 день</b> о дедлайне 🕔"

ADD_BIRTHDAY = "Давай добавим новый день рождения, праздник - это всегда здорово 🥳\nНапиши имя виновника торжества 👀"
PROCCESS_BIRTHDAY = lambda text: f"Отлично!\nКогда у \"<i>{text}</i> день рождения\"\n❓введи дату в формате DD.MM.YYYY, например 25.05.2006"
BIRTHDAY_ADD_SUCCESS = "Отлично!\nЯ напомню за <b>месяц</b>, <b>неделю</b> и <b>1 день</b> о днюхе 🤩"

HELP_TEXT = """
Привет, друг! 🐾 Я тут, чтобы сделать твою студенческую жизнь легче и веселее. Вот, что я умею:

🔮 Гадания и развлечения:

/tarot — вытащить карту Таро и узнать судьбу. Кто знает, что ждет впереди? 👁️
/wander_ball — спроси магический шар, что тебе делать. Ответы бывают... неожиданными. 🎱
/chill_student — узнай, какой ты сегодня студент: герой дедлайнов или король прокрастинации. 👑
/joke — расскажу тебе анекдот, заходит улитка в бар.. ой. 🤭
/joke_black — расскажу тебе анекдот, но там также может быть черный юмор, будь аккуратен. 👀

📅 Дедлайны:

/add_deadline — добавь новый дедлайн. Пусть ничего не проскользнет! 🔥
/view_deadlines — взгляни на свои текущие дедлайны. Ох, сколько их там... 📜
/remove_deadline — убери лишний дедлайн. Всё под контролем. ✅

🎂 Дни рождения:

/add_birthday — добавь дату ДР, чтобы никого не забыть. 🎁
/view_birthdays — посмотри, у кого скоро праздник. Готовь подарки! 🎉
/remove_birthday — удаляй ненужные записи.

💡 Если запутался, просто пиши /help, я всегда рядом. 💬
Давай дружить и покорять студенческую жизнь вместе! 😎
""".strip()
CRINGE_CONGRATS = [
    "С днюхой, король мемов! Пусть твоя жизнь будет таким же хайповым, как последний сезон 'Рик и Морти'. Желаю тебе стать легендой TikTok!",
    "Хэппи бёздей, наш космический путешественник! Пусть жизнь несёт тебя по галактикам успеха на ракете позитивчика. Только не забудь космическую пиццу прихватить!",
    "С днюхой, великая загадка вселенной! Пусть тебя окружают только те, кто тебя понимает... хотя бы на 1%. Желаю тонны лайков в жизни и в инсте!",
    "Поздравляю! Пусть в твоей жизни будет столько радости, сколько нервов у твоего Wi-Fi роутера. И помни: жизнь — это не баг, это фича!",
    "С днём варенья, капитан кринжа! Пусть твоё сердце бьётся с мощью старого доброго 'Windows XP'. Никогда не зависай и живи без ошибок!",
    "С днюшкой, хедлайнер мемов! Пусть каждая твоя шутка вызывает такие взрывы смеха, чтобы соседи подумали, что у тебя дискотека. Да будет с тобой сила кринжа!",
    "С праздником, маэстро лени! Пусть твой путь к успеху будет таким же лёгким, как найти кнопку 'Скипнуть рекламу' на YouTube. И пусть плейлист счастья играет бесконечно!",
    "Хэппи бёздей! Желаю тебе иметь такую же мотивацию к успеху, как у кота, который хочет залезть в коробку. Пусть все твои гениальные планы выходят за рамки — и коробки, и кринжа!",
    "С днём рождения, мастер великих планов! Пусть твоя жизнь будет сериалом, который всегда продлевают на новый сезон. Только без драматических сюжетов!",
    "С днюхой, величайший воитель кринжа! Пусть твоя аура притягивает только удачу, деньги и бесплатные обновления. Не забывай: ты всегда в тренде!"
]

MONTH_BEFORE_THE_BIRTHDAY = lambda name: f"<b>ВНИМАНИЕ❗</b>\nЧерез месяц у <i>{name}</i> день рождения 👀"
SEVEN_DAYS_BEFORE_THE_BIRTHDAY = lambda name: f"<b>ВНИМАНИЕ❗</b>\nРовно через 7 дней у <i>{name}</i> день рождения 😁 Все уже купили подапки ?)"
ONE_DAY_BEFORE_THE_BIRTHDAY = lambda name: f"<b>ВНИМАНИЕ❗</b>\nУже завтра у <i>{name}</i> день рождения 🥳 Вы готовы к вечеринке года ?🤩"

THREE_DAYS_BEFORE_THE_DEADLINE = lambda task: f"<b>ВНИМАНИЕ❗</b>\nРовно через 3 дней у вас сгорает дедлайн <i>{task}</i> 🔥"
ONE_DAY_BEFORE_THE_DEADLINE = lambda task: f"<b>ВНИМАНИЕ❗</b>\nУже завтра у вас сгорает дедлайн <i>{task}</i> 🔥🤯"
FINISH_DEADLINE = lambda task: f"Я удалил дедлайн <i>{task}</i> из списка дел ✅"
